app/controllers/insurance_entries_controller.rb

  def create
    @entry = InsuranceEntries.new(:insurance_company => params[:insurance_company],:surgery_code => params[:surgery_code], :is_approved => params[:is_approved])
    if @entry.save
---
INSERT INTO "insurance_entries" ("created_at", "insurance_company", "is_approved", "surgery_code", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 21 Nov 2012 06:42:13 UTC +00:00], ["insurance_company", "meh"], ["is_approved", nil], ["surgery_code", "3093"], ["updated_at", Wed, 21 Nov 2012 06:42:13 UTC +00:00]]

  def search
    @insurance_entry = InsuranceEntries.where("insurance_company = ? AND surgery_code = ?", params[:insurance_company], params[:surgery_code]).first
---
SELECT "insurance_entries".* FROM "insurance_entries" WHERE (insurance_company = 'aetna' AND surgery_code = '111') LIMIT 1

  def list
    @entries = InsuranceEntries.all
---
SELECT "insurance_entries".* FROM "insurance_entries" ORDER BY insurance_company ASC, surgery_code DESC

  def delete
    @insurance_entry = InsuranceEntries.where("insurance_company = ? AND surgery_code = ?", params[:insurance_company], params[:surgery_code]).first
    @insurance_entry.destroy
---
SELECT "insurance_entries".* FROM "insurance_entries" WHERE (insurance_company = 'meh' AND surgery_code = '3093') LIMIT 1
DELETE FROM "insurance_entries" WHERE "insurance_entries"."id" = ?  [["id", 1]]

  def update_entry
    @insurance_entry = InsuranceEntries.where("insurance_company = ? AND surgery_code = ?", params[:old_insurance_company], params[:old_surgery_code]).first
    @insurance_entry.update_attributes(:insurance_company => params[:insurance_company],:surgery_code => params[:surgery_code], :is_approved => (params[:is_approved] ? TRUE : FALSE))
---
SELECT "insurance_entries".* FROM "insurance_entries" WHERE (insurance_company = 'Aetna' AND surgery_code = '1111') LIMIT 1
UPDATE "insurance_entries" SET "insurance_company" = 'Aetnadd', "surgery_code" = '1sds', "is_approved" = 't', "updated_at" = '2012-11-24 17:00:19.488245' WHERE "insurance_entries"."id" = 20